app/Domain/Users/Actions/GetUsersToImpersonate.php

select * from `teams` where `teams`.`id` = '779387ca-f7e8-4425-ba4e-14394ab4de0d' limit 1
---
    public function handle(ActionRequest $request)
    {
        try {
            $data = $request->validated();

            $user = auth()->user();
            $user_role = $user->getRole();

            // Get the User's currently active team
            $team = $user->currentTeam()->first();

            if (array_key_exists('team', $data)) {
                if ($user->inSecurityGroup(SecurityGroupEnum::ADMIN)) {
                    $team = Team::withoutGlobalScopes()->findOrFail($data['team']);
                } else {
                    $team = Team::findOrFail($data['team']);

select * from `team_user` where `team_user`.`team_id` = '779387ca-f7e8-4425-ba4e-14394ab4de0d' and `team_user`.`team_id` is not null
---
            $users = [];

            // get the users for that team
            $imp_users = $team->team_users()->get();

select * from `users` where `users`.`id` = 40 limit 1
---
                if (! is_null($imp_user->user)) {
                    $users[] = $imp_user->user;
                } else {
                    $users[] = User::withoutGlobalScopes()->findOrFail($imp_user->user_id);