app/Domain/Users/Actions/ImpersonateUser.php

    public function handle(): mixed
    {
        $results = false;
        $data = request()->all();

        $invader = auth()->user();
        if ($invader->inSecurityGroup(SecurityGroupEnum::ADMIN)) {
            $victim = User::withoutGlobalScopes()->findOrFail($data['victimId']);
            $team = Team::withoutGlobalScopes()->findOrFail(UserDetails::withoutGlobalScopes()->whereUserId($victim->id)->whereField('default_team_id')->first()->value);
---
select * from `users` where `users`.`id` = '40' limit 1
select * from `teams` where `teams`.`id` = '2ac9e7b4-e468-437e-88ab-0d0a2831355b' limit 1
select * from `user_details` where `user_id` = 40 and `field` = 'default_team_id' limit 1