app/Http/Middleware/HandleInertiaRequests.php

    public function share(Request $request)
    {
        $shared = [];
        $user = $request->user();
        if ($request->user()) {
            $current_team_id = CurrentInfoRetriever::getCurrentTeamID();
            $abilities = $user->getAbilities()->filter(function ($ability) use ($user, $current_team_id) {
                if (! is_null($ability->entity_id)) {
                    $r = $ability->entity_id === $current_team_id;
                } elseif ($ability->title == 'All abilities') {
                    $r = true;
                } else {
                    $r = true;
                }

                return $r;
            })->pluck('name');

            $client = Client::with(['details', 'trial_membership_types', 'locations'])->find($user->client_id);
            $shared = [
                'user.id' => $user->id,
                'user.contact_preference' => $user->contact_preference,
                'user.all_locations' => $user->user_type === UserTypesEnum::EMPLOYEE ? $user->allLocations() : null,
                'user.current_team.isClientTeam' => $user->client_id !== null,
                'user.is_client_user' => $user->client_id !== null,
                'user.is_gr_admin' => $user->inSecurityGroup(SecurityGroupEnum::ADMIN),
                'user.current_team_id' => session()->get('current_team')['id'] ?? null,
                'user.current_team_id1' => session()->get('current_team_id'),
                //TODO:should be able to remove client_id from most of client stuff once middleware is in place
                'user.abilities' => $abilities,
                'user.has_api_token' => (! is_null($user->access_token)),
                'app_state.is_simulation_mode' => AppState::isSimuationMode(),
                'client_services' => $client->services ?? null,
//                TODO: Query this from the CRUD when it is being initialized
                'user.column_config' => $user->column_config->mapWithKeys(function ($item, $key) {
                    return [$item->value => $item->misc];
                }),

            ];
---
select * from `clients` where `clients`.`id` = 'a7665867-e93b-41b9-89fb-72ba0b06d2bb' and `clients`.`deleted_at` is null limit 1
select * from `locations` where `locations`.`client_id` in ('a7665867-e93b-41b9-89fb-72ba0b06d2bb') and `locations`.`deleted_at` is null and `client_id` = 'a7665867-e93b-41b9-89fb-72ba0b06d2bb'
select * from `trial_membership_types` where `trial_membership_types`.`client_id` in ('a7665867-e93b-41b9-89fb-72ba0b06d2bb') and `trial_membership_types`.`deleted_at` is null