app/Domain/Clients/Actions/GetClients.php

    public function handle(): Collection
    {
        return Client::orderBy('name', 'asc')->get(['name', 'id']);
---
select `name`, `id` from `clients` where `clients`.`deleted_at` is null order by `name` asc