app/Domain/Clients/Actions/GetTeams.php

    public function handle(string $client_id = null, $current_user = null)
    {
        if ($current_user && $current_user->inSecurityGroup(SecurityGroupEnum::ADMIN)) {
            $Team = Team::withoutGlobalScopes()->whereClientId($client_id);
        } elseif ($current_user) {
            $Team = Team::whereIn('id', $current_user->allTeams()->pluck('id'));
        }

        return $Team->orderBy('home_team', 'desc')->orderBy('name', 'asc')->get(['name', 'id']);
---
select `name`, `id` from `teams` where `client_id` = 'a7665867-e93b-41b9-89fb-72ba0b06d2bb' order by `home_team` desc, `name` asc