app/Domain/Users/Models/User.php

select * from `locations` where `locations`.`deleted_at` is null and `client_id` = 'a7665867-e93b-41b9-89fb-72ba0b06d2bb'
---
    public function allLocations()
    {
        return Location::whereClientId($this->currentClientId())->get();