app/Models/Utility/AppState.php

    public static function isSimuationMode(): bool
    {
        $results = true;

        $record = self::whereSlug('is-simulation-mode')->first();
---
select * from `app_states` where `slug` = 'is-simulation-mode' and `app_states`.`deleted_at` is null limit 1