app/Http/Controllers/UsersController.php

select * from `roles` where `scope` = 'a7665867-e93b-41b9-89fb-72ba0b06d2bb' and (`roles`.`scope` = 'a7665867-e93b-41b9-89fb-72ba0b06d2bb' or `roles`.`scope` is null)
select `teams`.*, `team_user`.`user_id` as `pivot_user_id`, `team_user`.`team_id` as `pivot_team_id` from `teams` inner join `team_user` on `teams`.`id` = `team_user`.`team_id` where `team_user`.`user_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23) and `client_id` is null
select * from `team_user` where `team_id` = '2ac9e7b4-e468-437e-88ab-0d0a2831355b'
select * from `locations` where `locations`.`deleted_at` is null and `client_id` = 'a7665867-e93b-41b9-89fb-72ba0b06d2bb'
select * from `clients` where `clients`.`id` = 'a7665867-e93b-41b9-89fb-72ba0b06d2bb' and `clients`.`deleted_at` is null limit 1
select * from `teams` where `teams`.`id` in ('', '', '', '', '', '', '', '', '', '', '', '') and `client_id` = 'a7665867-e93b-41b9-89fb-72ba0b06d2bb'
---
    public function index(Request $request)
    {
        // Check the client ID to determine if we are in Client or Cape & Bay space
        $client_id = $request->user()->client_id;

        //Default Render VARs
        $locations = [];
        $teams = [];
        $clientName = 'Cape & Bay/GymRevenue';
        $filterKeys = ['search', 'club', 'team', 'roles',];

        //Populating Role Filter
        $roles = Role::whereScope($client_id)->get();

        if ($client_id) {
            $client = Client::find($client_id);

            $locations = Location::all();
            $teams = Team::findMany(Client::with('teams')->find($client_id)->teams()->get()->pluck('id'));
            $clientName = $client->name;

        }
//TODO: we should not need to pass anything back but filters maybe?
        return Inertia::render('Users/Show', [
            'filters' => $request->all($filterKeys),
            'clubs' => $locations,
            'teams' => $teams,
            'clientName' => $clientName,
            'potentialRoles' => $roles,
        ]);