app/Http/Controllers/UsersController.php

    public function create(Request $request)
    {
        // Get the logged-in user making the request
        $user = request()->user();
        // Get the user's currently accessed team for scoping
        $current_team = CurrentInfoRetriever::getCurrentTeam();
        // Get the first record linked to the client in client_details, this is how we get what client we're assoc'd with
        // CnB Client-based data is not present in the DB and thus the details could be empty.
        $client = $current_team->client;
        // IF we got details, we got the client name, otherwise its Cape & Bay
        $client_name = (! is_null($client)) ? $client->name : 'Cape & Bay';

        $client_id = request()->user()->client_id;

        // The logged in user needs the ability to create users scoped to the current team to continue
        if ($user->cannot('users.create', User::class)) {
            Alert::error("Oops! You dont have permissions to do that.")->flash();

            return Redirect::back();
        }

        $locations = null;
        if ($client) {
            $locations = Location::get(['name', 'gymrevenue_id']);
        }

        $roles = Role::whereScope($client_id)->get();

        // Take the data and pass it to the view.
        return Inertia::render('Users/Create', [
            'roles' => $roles,
            'clientName' => $client_name,
            'locations' => $locations,
            'availablePositions' => Position::with('departments')->select('id', 'name')->get(),
            'availableDepartments' => Department::with('positions')->select('id', 'name')->get(),
        ]);
---
select * from `clients` where `clients`.`id` = 'a7665867-e93b-41b9-89fb-72ba0b06d2bb' and `clients`.`deleted_at` is null limit 1
select `name`, `gymrevenue_id` from `locations` where `locations`.`deleted_at` is null and `client_id` = 'a7665867-e93b-41b9-89fb-72ba0b06d2bb'

    public function edit(User $user)
    {
        $me = request()->user();

        $client_id = request()->user()->client_id;

        if ($me->cannot('users.update', User::class)) {
            Alert::error("Oops! You dont have permissions to do that.")->flash();

            return Redirect::back();
        }

        $user->load('details', 'notes', 'files', 'contact_preference', 'emergencyContact');//TODO:get rid of loading all details here.

        if ($me->id == $user->id) {
            return Redirect::route('profile.show');
        }

        $roles = Role::whereScope($client_id)->get();
---
select * from `roles` where `scope` = 'a7665867-e93b-41b9-89fb-72ba0b06d2bb' and (`roles`.`scope` = 'a7665867-e93b-41b9-89fb-72ba0b06d2bb' or `roles`.`scope` is null)