app/Actions/Dashboard/Home/GetDashboardWidgets.php

    public function handle() : array
    {
        $results = [];

        $team = auth()->user()->currentTeam;
        $client_detail = $team->client_details()->first();
---
select * from `teams` where `teams`.`id` = '2ac9e7b4-e468-437e-88ab-0d0a2831355b' and `client_id` = 'a7665867-e93b-41b9-89fb-72ba0b06d2bb' limit 1