app/Providers/JetstreamServiceProvider.php

select * from `teams` where `teams`.`id` = '8b794ddb-27b0-4f10-8299-3009dbfca936' limit 1
select * from `users` where `email` = 'zaid@capeandbay.com' limit 1
---
    public function boot()
    {
        $this->configurePermissions();

        Jetstream::useUserModel(User::class);
        Jetstream::useTeamModel(Team::class);
        Jetstream::useTeamInvitationModel(TeamInvitation::class);

        Jetstream::createTeamsUsing(CreateTeam::class);
        Jetstream::updateTeamNamesUsing(UpdateTeamName::class);
        Jetstream::addTeamMembersUsing(AddTeamMember::class);
        Jetstream::inviteTeamMembersUsing(InviteTeamMember::class);
        Jetstream::removeTeamMembersUsing(RemoveTeamMember::class);
        Jetstream::deleteTeamsUsing(DeleteTeam::class);
        Jetstream::deleteUsersUsing(DeleteUser::class);
        Fortify::authenticateUsing(function (Request $request) {
            //Call withoutGlobalScopes so we don't try to apply client_id on login
            $user = User::withoutGlobalScopes()->with('defaultTeam')->where('email', $request->email)->first();

            if ($user &&
                Hash::check($request->password, $user->password)) {
                // dd($user->toArray());
                //Successfull CRM Auth -
                //Let's set some info in our cookie session so we
                // can use it in middleware / global scopes
                // without having to hit the db
                $team = $user->defaultTeam->team;
                if ($team !== null) {
                    session()->put('current_team_id', $team->id);
                    session()->put(
                        'current_team',
                        [
                            'id' => $team->id,
                            'name' => $team->name,
                            'client_id' => $team->client_id,
                        ]